12/data/attachments/5cb81ee5e207e939.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d7ff4ba-9992-45e7-a513-fb032074ddca</nif:username>
            <nif:friendToBeAdded>Dale_somebody_Friend_90875_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>